import React from 'react';

import s from './document.module.css'

type DocumentType={
    title:string
}


export const Document = (props:DocumentType) => (
    <section className={s.termsWrapper}>
        <h2>{props.title}</h2>
        <ol className={`${s.termsList} ${s.ol}`}>
            <li className={`${s.termsTitle} ${s.li}`}>Идейные соображения высшего порядка, а также
                высокое
                качество позиционных исследований представляет собой интересный эксперимент проверки
                экспериментов, поражающих по своей масштабности и грандиозности.
                <ol className={`${s.termsSubTitleList} ${s.ol}`}>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Задача организации, в особенности
                        же
                        социально-экономическое развитие однозначно определяет каждого участника как
                        способного принимать собственные решения касаемо инновационных методов
                        управления процессами.
                    </li>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Не следует, однако, забывать, что
                        разбавленное
                        изрядной долей эмпатии, рациональное мышление играет важную роль в
                        формировании приоритизации разума над эмоциями. Но некоторые особенности
                        внутренней политики лишь добавляют фракционных разногласий и преданы
                        социально-демократической анафеме.
                    </li>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Приятно, граждане, наблюдать, как
                        элементы
                        политического процесса, превозмогая сложившуюся непростую экономическую
                        ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
                    </li>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Но независимые государства, которые
                        представляют
                        собой яркий пример континентально-европейского типа политической культуры,
                        будут объединены в целые кластеры себе подобных.
                    </li>
                </ol>
            </li>
            <li className={`${s.termsTitle} ${s.li}`}>С учётом сложившейся международной обстановки,
                консультация
                с широким активом предоставляет широкие возможности для приоритизации разума над
                эмоциями.
                <ol className={`${s.termsSubTitleList} ${s.ol}`}>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Задача организации, в особенности
                        же
                        социально-экономическое развитие однозначно определяет каждого участника как
                        способного принимать собственные решения касаемо инновационных методов
                        управления процессами.
                        <ol className={`${s.termsSubTitleList} ${s.ol}`}>
                            <li className={`${s.termsText} ${s.li}`}>Не следует, однако, забывать,
                                что разбавленное изрядной долей
                                эмпатии, рациональное мышление играет важную роль в формировании
                                приоритизации разума над эмоциями. Но некоторые особенности
                                внутренней политики лишь добавляют фракционных разногласий и преданы
                                социально-демократической анафеме.
                            </li>
                            <li className={`${s.termsText} ${s.li}`}>Приятно, граждане, наблюдать,
                                как элементы политического процесса,
                                превозмогая сложившуюся непростую экономическую ситуацию, объявлены
                                нарушающими общечеловеческие нормы этики и морали.
                            </li>
                        </ol>
                    </li>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Но независимые государства, которые
                        представляют
                        собой яркий пример континентально-европейского типа политической культуры,
                        будут объединены в целые кластеры себе подобных.
                    </li>
                </ol>
            </li>
            <li className={`${s.termsTitle} ${s.li}`}>Принимая во внимание показатели успешности,
                укрепление и
                развитие внутренней структуры требует от нас анализа приоритизации разума над
                эмоциями.
                <ol className={`${s.termsSubTitleList} ${s.ol}`}>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Задача организации, в особенности
                        же социально-экономическое развитие
                        однозначно определяет каждого участника как способного принимать собственные
                        решения касаемо инновационных методов управления процессами.
                        <ol className={`${s.termsSubTitleList} ${s.ol}`}>
                            <li className={`${s.termsText} ${s.li}`}>Не следует, однако, забывать,
                                что разбавленное изрядной долей
                                эмпатии, рациональное мышление играет важную роль в формировании
                                приоритизации разума над эмоциями. Но некоторые особенности
                                внутренней политики лишь добавляют фракционных разногласий и преданы
                                социально-демократической анафеме.
                            </li>
                            <li className={`${s.termsText} ${s.li}`}>Приятно, граждане, наблюдать,
                                как элементы политического процесса,
                                превозмогая сложившуюся непростую экономическую ситуацию, объявлены
                                нарушающими общечеловеческие нормы этики и морали.
                            </li>
                        </ol></li>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Но независимые государства, которые
                        представляют собой яркий пример
                        континентально-европейского типа политической культуры, будут объединены в
                        целые кластеры себе подобных.
                    </li>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Не следует, однако, забывать, что
                        экономическая повестка сегодняшнего дня
                        требует анализа анализа существующих паттернов поведения.
                        <ol className={`${s.termsSubTitleList} ${s.ol}`}>
                            <li className={`${s.termsText} ${s.li}`}>А ещё представители современных
                                социальных резервов набирают
                                популярность среди определенных слоев населения, а значит, должны
                                быть функционально разнесены на независимые элементы.
                                <ol className={`${s.termsSubTitleList} ${s.ol}`}>
                                    <li className={`${s.termsSubText} ${s.li}`}>Стремящиеся
                                        вытеснить традиционное производство,
                                        нанотехнологии могут быть объявлены нарушающими
                                        общечеловеческие нормы этики и морали.
                                    </li>
                                    <li className={`${s.termsSubText} ${s.li}`}>Прежде всего,
                                        разбавленное изрядной долей эмпатии,
                                        рациональное мышление однозначно фиксирует необходимость
                                        новых предложений. Являясь всего лишь частью общей картины,
                                        независимые государства представлены в исключительно
                                        положительном свете.
                                    </li>
                                </ol></li>
                        </ol></li>
                    <li className={`${s.termsSubTitle} ${s.li}`}>Повседневная практика показывает,
                        что убеждённость некоторых оппонентов
                        требует от нас анализа распределения внутренних резервов и ресурсов.
                    </li>
                </ol>
            </li>
        </ol>
    </section>
);


